courses = ["Java-разработчик с нуля", "Fullstack-разработчик на Python", "Python-разработчик с нуля", "Frontend-разработчик с нуля"]
mentors = [
	["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский", "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов", "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
	["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
	["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев", "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина", "Азамат Искаков", "Роман Гордиенко"],
	["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин", "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
]
durations = [14, 20, 12, 20]


def recordsmen(courses, mentors, durations):
    courses_list = []

    for title, mentor,duraction in zip(courses, mentors, durations):
	# Этот блок кода создает словарь с информацией о курсах
        course_dict = {"title": title, "mentor": mentors, "duration": durations}
        courses_list.append(course_dict)

# Находим минимальное и максимальное значение из списка длительностей курсов
    min_duration = min(durations)
    max_duration = max(durations)

# Создаем пустые списки для индексов минимальных и максимальных значений
    maxes = []
    minis = []
# Проходимся по списку длительностей курсов и находим индексы минимальных и максимальных значений
    for id, lengh_duration in enumerate(durations):
        if lengh_duration == max_duration:
            maxes.append(id)
        elif lengh_duration == min_duration:
            minis.append(id)

# Создаем списки с названиями курсов с минимальной и максимальной длительностями
    courses_min = []
    courses_max = []
    for id in minis:
        courses_min.append(courses_list[id]["title"]) 
    for id in maxes:
        courses_max.append(courses_list[id]["title"])
    return courses_list

# вызавляем функцию и выводим результат
# print(recordsmen(courses, mentors, durations))


